src/main/resources/doAirShopping_OW1Adt1Ch.text

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.iata.org/IATA/EDIST/2017.2">   <soapenv:Header/>   <soapenv:Body>   <AirShoppingRQ Version="IATA2017.2" xsi:schemaLocation="xmldsig-core-schema.xsd"    xmlns="http://www.iata.org/IATA/EDIST/2017.2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">    <Document>    <Name>HITIT NDC GATEWAY</Name>    <ReferenceVersion>1.0</ReferenceVersion>    </Document>    <Party>    <Sender>    <TravelAgencySender>    <Contacts>    <Contact>    <EmailContact>    <Address>craneNDC@flypgs.com</Address>    </EmailContact>    </Contact>    </Contacts>    <AgencyID>PC NDC</AgencyID>    <AgentUser>    <Name>HITITADMIN</Name>    <AgentUserID>T621OC48</AgentUserID>    <UserRole>ADMIN</UserRole>    </AgentUser>    </TravelAgencySender>    </Sender>    </Party>    <Parameters>    <Languages>    <LanguageCode>TR</LanguageCode>    </Languages>    <CurrCodes>    <FiledInCurrency>    <CurrCode>TRY</CurrCode>    </FiledInCurrency>    </CurrCodes>    </Parameters>    <CoreQuery>    <OriginDestinations>    <OriginDestination>    <Departure>    <AirportCode>replaceAirportCodefirst</AirportCode>    <Date>replaceDate</Date>    </Departure>    <Arrival>    <AirportCode>replaceAirportCodesecond</AirportCode>    </Arrival>    </OriginDestination>    </OriginDestinations>    </CoreQuery>    <Preference>    <CabinPreferences>    <CabinType>    <Code>Eco</Code>    </CabinType>    </CabinPreferences>    </Preference>    <DataLists>    <PassengerList>    <Passenger PassengerID="SH1">    <PTC>ADT</PTC>    </Passenger>    <Passenger PassengerID="SH2">    <PTC>CHD</PTC>    </Passenger>    </PassengerList>    </DataLists></AirShoppingRQ>   </soapenv:Body></soapenv:Envelope>